Ela embarcou em Southampton (Inglaterra)
Ela era da segunda classe
Ela tinha 29.0 anos
E no nome completo dela tinha Anne, mas ele n√£o sabe se era nome ou sobrenome.
Lembre sempre de retirar os valores NaN das colunas (aplique outro valor no lugar deles)

In [1]:
import  pandas as pd

In [3]:
titanic= pd.read_csv("titanic.csv")

df = titanic.dropna()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [6]:
filtro = (
    (titanic["Embarked"] =='S') & (titanic["Pclass"]== 2) & (titanic["Age"] == 29) &(titanic["Name"].str.contains('Anne'))
)
titanic[filtro]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0,1,0,2926,26.0,NaN,S